src/cf/Enums/ВидыОшибокСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОшибокСПАРКРиски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяОшибкаСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетПоддержкаНеПодключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеЗапрещено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеОтключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеизвестнаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеизвестныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодлежитПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАутентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПодключения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПревышеноКоличествоПопытокАутентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплатаИлиПревышенЛимит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияВыводаИндексовСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияВыводаИндексовСПАРКРиски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКэшеНетДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКэшеУстаревшиеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеправильныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзКэша</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФоновогоЗадания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/СправкиСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СправкиСПАРКРиски</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентовСПАРКРиски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСправкиСПАРКРиски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/СПАРКРискиВызовСервера/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "СПАРК".
// ОбщийМодуль.СПАРКРискиВызовСервера.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать СПАРКРискиКлиент.ИспользованиеРазрешено.
// Определяет возможность использования сервиса в соответствии с текущим
//  режимом работы и правами пользователя.
//
// Возвращаемое значение:
//  Булево - Истина - использование разрешено, Ложь - в противном случае.
//
Функция ИспользованиеРазрешено() Экспорт

	Возврат СПАРКРиски.ИспользованиеРазрешено();

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СправочникиКонтрагенты() Экспорт
	
	Результат = Новый СписокЗначений;
	
	СвойстваСправочников = СПАРКРиски.СвойстваСправочниковКонтрагентов();
	Для Каждого ОписаниеСправочника Из СвойстваСправочников Цикл
		Результат.Добавить(
			Новый Структура("Имя, ИмяФормыПодбора",
				ОписаниеСправочника.Имя,
				ОписаниеСправочника.ИмяФормыПодбора),
			Метаданные.Справочники[ОписаниеСправочника.Имя].Синоним);
	КонецЦикла;
	
	Результат.СортироватьПоПредставлению();
	
	Возврат Результат;
	
КонецФункции

// Определяет возможность использования сервиса в соответствии с текущим
//  режимом работы и правами пользователя.
//
// Возвращаемое значение:
//  Булево - Истина - использование разрешено, Ложь - в противном случае.
//
Функция СлужебнаяИспользованиеРазрешено() Экспорт

	Возврат СПАРКРиски.ИспользованиеРазрешено();

КонецФункции

#Область СобытияМониторинга

Процедура ВключитьОтключитьМониторингСобытийКонтрагента(Знач Контрагент, Знач МониторингВключен) Экспорт
	
	Если Не СПАРКРиски.ИспользованиеРазрешено("ПостановкаНаМониторинг;") Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для постановки контрагентов на мониторинг.'");
	КонецЕсли;
	
	СПАРКРиски.ВключитьОтключитьМониторингСобытий(Контрагент, МониторингВключен, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ИндексыСПАРКРиски

// Возвращает информацию о контрагенте (индексы и прочая информация).
// В случае, если информации нет в кэше, то инициируется фоновое задание.
// Если передан ИНН, то информация получается напрямую из веб-сервиса без фонового задания.
//
// Параметры:
//  Контрагент - ОпределяемыйТип.КонтрагентБИП, Строка - Контрагент или ИНН контрагента;
//  ВидКонтрагента - ПеречислениеСсылка.ВидыКонтрагентовСПАРКРиски - вид проверки данных контрагента;
//  ПризнакЗагрузкиДанных - Булево - если ИСТИНА, то в случае, если данных нет или они просрочены, то запустить фоновое
//    задание загрузки данных.
//
// Возвращаемое значение:
//  см. СПАРКРискиКлиентСервер.НовыйДанныеИндексов
//
Функция ИндексыСПАРККонтрагента(Знач Контрагент, Знач ВидКонтрагента, Знач ПризнакЗагрузкиДанных = Ложь) Экспорт

	Результат = СПАРКРиски.ИндексыСПАРККонтрагента(
		Контрагент,
		ВидКонтрагента,
		ПризнакЗагрузкиДанных);

	Возврат Результат;

КонецФункции

// Процедура предназначена для проверки завершенности фоновых заданий.
//
// Параметры:
//  ПроверяемыеФоновыеЗадания - Массив - массив структур,
//                              описанных в СПАРКРискиКлиент.НовыйПроверкаЗавершенностиФоновогоЗадания.
//
// Возвращаемое значение:
//   Массив - массив структур, описанных в СПАРКРискиКлиент.НовыйПроверкаЗавершенностиФоновогоЗадания.
//
Функция ПроверкаЗавершенностиФоновыхЗаданий(Знач ПроверяемыеФоновыеЗадания) Экспорт

	Результат = СПАРКРиски.ПроверкаЗавершенностиФоновыхЗаданий(ПроверяемыеФоновыеЗадания);

	Возврат Результат;

КонецФункции

// Из результата работы веб-сервиса, сохраненного в 
//
// Параметры:
//  АдресВременногоХранилища - Строка - адрес временного хранилища, в котором хранится
//                                      результат вызова СервисСПАРКРиски.ЗагрузитьИндексыКонтрагентов.
//
// Возвращаемое значение:
//   Структура - структура, как описано в СПАРКРискиКлиентСервер.НовыйДанныеИндексов.
//
Функция ПолучитьПервыйИндекс(Знач АдресВременногоХранилища) Экспорт

	Результат = СПАРКРискиКлиентСервер.НовыйДанныеИндексов();
	Результат.РаботаВМоделиСервиса = ОбщегоНазначения.РазделениеВключено();
	Результат.ДанныеАутентификацииЗаполнены
		= ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	
	// После вызова функции необходимо самостоятельно дозаполнить ключ ДатаОбновления:
	//  ТекущаяДатаСеанса() - для сервера или ОбщегоНазначенияКлиент.ДатаСеанса() - для клиента.
	Результат.Вставить("ДатаОбновления", ТекущаяДатаСеанса());

	ТипСтруктура       = Тип("Структура");
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");

	Если ПустаяСтрока(АдресВременногоХранилища) Тогда
		Результат.Вставить("ВидОшибки", Перечисления.ВидыОшибокСПАРКРиски.НеизвестнаяОшибка);
		Результат.Вставить("ТекстОшибки", НСтр("ru='Вызов веб-сервиса не сохранил данные в хранилище.'"));
		Результат.Вставить("СостояниеВыводаДанных", Перечисления.СостоянияВыводаИндексовСПАРКРиски.ВКэшеНетДанных);
		Результат.Вставить("СостояниеЗагрузкиДанных", Перечисления.СостоянияЗагрузкиИндексовСПАРКРиски.ПустаяСсылка());
	Иначе
		ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		Если (ТипЗнч(ДанныеХранилища) = ТипСтруктура) Тогда
			Если (ТипЗнч(ДанныеХранилища.ЗначенияИндексов) = ТипТаблицаЗначений)
				И (ДанныеХранилища.ЗначенияИндексов.Количество() > 0) Тогда
				ЗаполнитьЗначенияСвойств(Результат, ДанныеХранилища.ЗначенияИндексов[0]);
				ЗаполнитьЗначенияСвойств(
					Результат,
					ДанныеХранилища,
					"ДоступностьПодключенияТестовогоПериода, ОшибкаПриПроверкеТестовогоПериода");
				Если ЗначениеЗаполнено(Результат.Статус) Тогда
					Результат.Критичное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						Результат.Статус,
						"Критичное");
				КонецЕсли;
			КонецЕсли;
			Если НЕ ДанныеХранилища.ВидОшибки.Пустая() Тогда
				Результат.Вставить("ВидОшибки", ДанныеХранилища.ВидОшибки);
				Результат.Вставить("ПодлежитПроверке", Истина); // Чтобы отобразилась панель с описанием сервиса.
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция получает цвет стиля по имени элемента стиля.
//
// Возвращаемое значение:
// Структура - значение цветов стилей.
//
Функция ЦветаСтилей() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЦветОсобогоТекста",           ЦветаСтиля.ЦветОсобогоТекста);
	Результат.Вставить("ЦветГрадацияСПАРКНизкийРиск", ЦветаСтиля.ЦветГрадацияСПАРКНизкийРиск);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОтчетыСПАРКРиски

Функция ОпределитьДанныеРасшифровкиСобытияМониторингаСПАРКРиски(
		Знач АдресДанных,
		Знач Идентификатор,
		СтандартнаяОбработка) Экспорт
	
	Возврат Отчеты.СобытияМониторингаСПАРКРиски.ОпределитьДанныеРасшифровкиОтчета(
		АдресДанных,
		Идентификатор,
		СтандартнаяОбработка);
	
КонецФункции

Функция ОпределитьДанныеРасшифровкиИндексовСПАРКРиски(
		Знач АдресДанных,
		Знач Идентификатор,
		СтандартнаяОбработка) Экспорт
	
	ДанныеРасшифровки   = ПолучитьИзВременногоХранилища(АдресДанных);
	
	ЗначениеРасшифровки = ДанныеРасшифровки.Элементы[Идентификатор];
	ПоляРасшифровки     = ЗначениеРасшифровки.ПолучитьПоля();
	
	Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		Если ПолеРасшифровки.Поле = "ПараметрыДанных.НадписьНаПортале" Тогда
			СтандартнаяОбработка = Ложь;
			Возврат ПолеРасшифровки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("ОткрытьФорму",   Ложь);
	ПараметрыРасшифровки.Вставить("Форма",          "");
	ПараметрыРасшифровки.Вставить("ПараметрыФормы", Неопределено);
	
	Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		Если ПолеРасшифровки.Поле = "Досье" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Отчет.ДосьеКонтрагента.Форма";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("Контрагент", ПолеРасшифровки.Значение);
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "СводныйИндикатор" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Обработка.СправкаСПАРКРиски.Форма.РасшифровкаДанныхСПАРКРиски";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("ВидФормы", "SPARK:WhatIsCompositeIndex");
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "ИндексПлатежнойДисциплины" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Обработка.СправкаСПАРКРиски.Форма.РасшифровкаДанныхСПАРКРиски";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("ВидФормы", "SPARK:WhatIsPaymentIndex");
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "ИндексФинансовогоРиска" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Обработка.СправкаСПАРКРиски.Форма.РасшифровкаДанныхСПАРКРиски";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("ВидФормы", "SPARK:WhatIsFailureScore");
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "ИндексДолжнойОсмотрительности" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Обработка.СправкаСПАРКРиски.Форма.РасшифровкаДанныхСПАРКРиски";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("ВидФормы", "SPARK:WhatIsIndexOfDueDiligence");
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "Статус" И ЗначениеЗаполнено(ПолеРасшифровки.Значение) Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Обработка.СправкаСПАРКРиски.Форма.РасшифровкаДанныхСПАРКРиски";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("ВидФормы, Статус", "SPARK:StatusDescription", ПолеРасшифровки.Значение);
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ПолеРасшифровки.Поле = "Справка" Тогда
			ПараметрыРасшифровки.ОткрытьФорму = Истина;
			ПараметрыРасшифровки.Форма = "Документ.СправкиСПАРКРиски.Форма.ФормаСписка";
			ПараметрыРасшифровки.ПараметрыФормы = Новый Структура("Контрагент", ПолеРасшифровки.Значение, Истина);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

#КонецОбласти

#Область ВебВерсияСПАРКРиски

Функция URLВебВерсииСПАРК(Знач Контрагент) Экспорт
	
	Возврат СПАРКРиски.URLВебВерсииСПАРК(Контрагент);
	
КонецФункции

#КонецОбласти

#КонецОбласти
